cami/Adafruit_nRF52_Arduino/libraries/BG96_LibForArduino/src/NectisCellular.cpp
#include "NectisCellular.h"

#include "Internal/Debug.h"
#include "Internal/StringBuilder.h"
#include "Internal/ArgumentParser.h"

#include "NectisCellularConfig.h"

#include "WioCellular.h"
#include "WioCellularHardware.h"

#include <string.h>
#include <limits.h>

#include <nrf.h>
#include <Uart.h>


#define INTERVAL                        (10000)
#define RECEIVE_TIMEOUT                 (10000)
#define CONNECT_ID_NUM                  (12)
#define POLLING_INTERVAL                (100)

#define APN                             "soracom.io"
#define USERNAME                        "sora"
#define PASSWORD                        "sora"

#define ENDPOINT_URL                    "http://unified.soracom.io"

#if defined BINARY_PARSER_ENABLED
    #define HTTP_CONTENT_TYPE               "application/octet-stream"
#else
    #define HTTP_CONTENT_TYPE           "application/json"
#endif

#define HTTP_USER_AGENT                 "QUECTEL_MODULE"
#define HTTP_CONTENT_TYPE               "application/json"

#define RET_OK(val)                     (ReturnOk(val))
#define RET_ERR(val, err)               (ReturnError(__LINE__, val, err))
#define LINEAR_SCALE(val, inMin, inMax, outMin, outMax)    (((val) - (inMin)) / ((inMax) - (inMin)) * ((outMax) - (outMin)) + (outMin))

char hexConvertedFromDecimal[16];


NectisCellular::NectisCellular() : _SerialAPI(&SerialUART), _AtSerial(&_SerialAPI, this) {
}


////////////////////////////////////////////////////////////////////////////////////////
// Helper functions

//static bool SplitUrl(const char *url, const char **host, int *hostLength, const char **uri, int *uriLength) {
//    if (strncmp(url, "http://", 7) == 0) {
//    *host = &url[7];
//    } else if (strncmp(url, "https://", 8) == 0) {
//    *host = &url[8];
//    } else {
//    return false;
//    }
//
//    const char *ptr;
//    for (ptr = *host; *ptr != '\0'; ptr++) {
//    if (*ptr == '/')
//        break;
//    }
//    *hostLength = ptr - *host;
//    *uri = ptr;
//    *uriLength = strlen(ptr);
//
//    return true;
//}


////////////////////////////////////////////////////////////////////////////////////////
// The same as WioCellular

bool NectisCellular::ReturnError(int lineNumber, bool value, NectisCellular::ErrorCodeType errorCode) {
    _LastErrorCode = errorCode;

    char str[100];
    sprintf(str, "%d", lineNumber);
    DEBUG_PRINT("ERROR! ");
    DEBUG_PRINTLN(str);

    return value;
}

int NectisCellular::ReturnError(int lineNumber, int value, NectisCellular::ErrorCodeType errorCode) {
    _LastErrorCode = errorCode;

    char str[100];
    sprintf(str, "%d", lineNumber);
    DEBUG_PRINT("ERROR! ");
    DEBUG_PRINTLN(str);

    return value;
}

bool NectisCellular::IsBusy() const {
    return digitalRead(MODULE_STATUS_PIN) ? false : true;
}

bool NectisCellular::IsRespond() {
#ifndef ARDUINO_ARCH_STM32
    auto writeTimeout = SerialUART.getWriteTimeout();
    SerialUART.setWriteTimeout(10);
#endif // ARDUINO_ARCH_STM32

    Stopwatch sw;
    sw.Restart();
    while (!_AtSerial.WriteCommandAndReadResponse("AT", "^OK$", 500, NULL)) {
        if (sw.ElapsedMilliseconds() >= 2000) {
#ifndef ARDUINO_ARCH_STM32
            SerialUART.setWriteTimeout(writeTimeout);
#endif // ARDUINO_ARCH_STM32
            return false;
        }
    }

#ifndef ARDUINO_ARCH_STM32
    SerialUART.setWriteTimeout(writeTimeout);
#endif // ARDUINO_ARCH_STM32
    return true;
}

bool NectisCellular::Reset() {
    digitalWrite(MODULE_RESET_PIN, HIGH);
    delay(200);
    digitalWrite(MODULE_RESET_PIN, LOW);
    delay(300);

    return true;
}

bool NectisCellular::TurnOn() {
    delay(100);
    digitalWrite(MODULE_PWRKEY_PIN, HIGH);
    delay(600);
    digitalWrite(MODULE_PWRKEY_PIN, LOW);

    return true;
}

bool NectisCellular::HttpSetUrl(const char *url) {
    StringBuilder str;
    if (!str.WriteFormat("AT+QHTTPURL=%d", strlen(url)))
        return false;
    _AtSerial.WriteCommand(str.GetString());
    if (!_AtSerial.ReadResponse("^CONNECT$", 500, NULL))
        return false;

    _AtSerial.WriteBinary((const byte *) url, strlen(url));
    if (!_AtSerial.ReadResponse("^OK$", 500, NULL))
        return false;

    return true;
}

NectisCellular::ErrorCodeType NectisCellular::GetLastError() const {
    return _LastErrorCode;
}

void NectisCellular::Init() {
    ////////////////////
    // Module
    
    // Power Supply
    pinMode(MODULE_PWR_PIN, OUTPUT);            digitalWrite(MODULE_PWR_PIN, LOW);
    // Turn On/Off
    pinMode(MODULE_PWRKEY_PIN, OUTPUT);         digitalWrite(MODULE_PWRKEY_PIN, LOW);
    pinMode(MODULE_RESET_PIN, OUTPUT);          digitalWrite(MODULE_RESET_PIN, LOW);
    // Status Indication
    pinMode(MODULE_STATUS_PIN, INPUT_PULLUP);
    // Main SerialUART Interface
    pinMode(MODULE_DTR_PIN, OUTPUT);            digitalWrite(MODULE_DTR_PIN, LOW);
    
    ////////////////////
    // Led
    pinMode(LED_RED, OUTPUT);                   digitalWrite(LED_RED, LOW);
    pinMode(LED_BLUE, OUTPUT);                  digitalWrite(LED_BLUE, LOW);
    ////////////////////
    
    // AD Converter
    pinMode(BATTERY_LEVEL_ENABLE_PIN, OUTPUT);
    
    // Grove
    pinMode(GROVE_VCCB_PIN, OUTPUT);            digitalWrite(GROVE_VCCB_PIN, LOW);
}

void NectisCellular::PowerSupplyCellular(bool on) {
    digitalWrite(MODULE_PWR_PIN, on ? HIGH : LOW);
    delay(200);
    digitalWrite(MODULE_PWRKEY_PIN, on ? HIGH : LOW);
    delay(600);
    digitalWrite(MODULE_PWRKEY_PIN, LOW);
}

void NectisCellular::PowerSupplyGrove(bool on) {
    digitalWrite(MODULE_PWR_PIN, on ? HIGH : LOW);
    delay(100);
    digitalWrite(GROVE_VCCB_PIN, on ? HIGH : LOW);
}

bool NectisCellular::TurnOnOrReset() {
    std::string response;
    ArgumentParser parser;

    if (IsRespond()) {
        DEBUG_PRINTLN("Reset()");
        if (!Reset())
            return RET_ERR(false, E_UNKNOWN);
    } else {
        DEBUG_PRINTLN("TurnOn()");
        if (!TurnOn())
            return RET_ERR(false, E_UNKNOWN);
    }

    Stopwatch sw;
    sw.Restart();
    while (!_AtSerial.WriteCommandAndReadResponse("AT", "^OK$", 500, NULL)) {
        DEBUG_PRINT(".");
        DEBUG_PRINTLN("TurnOnOrReset: WriteCommandAndReadResponse");

