cami/Adafruit_nRF52_Arduino/libraries/BG96_LibForArduino/src/NectisCellular.cpp
bool NectisCellular::SocketSend(int connectId, const byte *data, int dataSize){
    return _Wio.SocketSend(connectId, data, dataSize);
}

bool NectisCellular::SocketSend(int connectId, const char *data){
    return _Wio.SocketSend(connectId, data);
}

int NectisCellular::SocketReceive(int connectId, byte *data, int dataSize){
    return _Wio.SocketReceive(connectId, data, dataSize);
}

int NectisCellular::SocketReceive(int connectId, byte *data, int dataSize, long timeout){
    return _Wio.SocketReceive(connectId, data, dataSize, timeout);
}

int NectisCellular::SocketReceive(int connectId, char *data, int dataSize){
    return _Wio.SocketReceive(connectId, data, dataSize);
}

int NectisCellular::SocketReceive(int connectId, char *data, int dataSize, long timeout){
    return _Wio.SocketReceive(connectId, data, dataSize,timeout);
}

bool NectisCellular::SocketClose(int connectId){
    return _Wio.SocketClose(connectId);
}

int NectisCellular::HttpGet(const char *url, char *data, int dataSize) {
    return _Wio.HttpGet(url, data, dataSize);
}

int NectisCellular::HttpGet(const char *url, char *data, int dataSize, const WioCellularHttpHeader &header) {
    return _Wio.HttpGet(url,data,dataSize, header);
}

bool NectisCellular::HttpPost(const char *url, const char *data, int *responseCode) {
    return _Wio.HttpPost(url, data, responseCode);
}

bool NectisCellular::HttpPost(const char *url, const char *data, int *responseCode, const WioCellularHttpHeader &header) {
    return _Wio.HttpPost(url, data, responseCode, header);
}

//TODO
// bool SendUSSD(const char *in, char *out, int outSize);

bool NectisCellular::HttpPost2(const char *url, const char *data, int *responseCode , char *recv_data, int recv_dataSize) {
    return _Wio.HttpPost2(url, data, responseCode, recv_data, recv_dataSize);
}

bool NectisCellular::HttpPost2(const char *url, const char *data, int *responseCode, char *recv_data, int recv_dataSize , const WioCellularHttpHeader &header) {
    return _Wio.HttpPost2(url, data, responseCode, recv_data, recv_dataSize, header);
}


////////////////////////////////////////////////////////////////////////////////////////
// NetisCellular

void NectisCellular::Bg96Begin() {
    // Initialize Uart between BL654 and BG96.
    Serial1.setPins(MODULE_UART_RX_PIN, MODULE_UART_TX_PIN, MODULE_RTS_PIN, MODULE_CTS_PIN);
    Serial1.begin(115200);

    delay(200);
}

void NectisCellular::Bg96End() {
    Serial1.end();
}

bool NectisCellular::Bg96TurnOff() {
    return TurnOff();
}

void NectisCellular::InitLteM() {
#ifdef ARDUINO_WIO_LTE_M1NB1_BG96
    SetAccessTechnology(ACCESS_TECHNOLOGY_LTE_M1);
    SetSelectNetwork(SELECT_NETWORK_MODE_MANUAL_IMSI);
#endif

    Serial.println("### Turn on or reset.");
    if (!TurnOnOrReset()) {
        Serial.println("### ERROR!; TurnOnOrReset ###");
        return;
    }

    delay(100);
    Serial.println("### Connecting to \"" APN "\".");
    if (!Activate(APN, USERNAME, PASSWORD)) {
        Serial.println("### ERROR!; Activate ###");
        return;
    }
}

void NectisCellular::SoftReset() {
    NVIC_SystemReset();
}

int NectisCellular::GetReceivedSignalStrengthIndicator() {
    int rssi = GetReceivedSignalStrength();
    int rssi_count = 0;
    while (rssi == - 999) {
        rssi = GetReceivedSignalStrength();
        if (rssi_count == 10) {
            SoftReset();
        }
        rssi_count++;
        delay(1000);
    }

    return rssi;
}

bool NectisCellular::IsTimeGot(struct tm *tim) {
    std::string response;
    
    // AT+QLTS=1 -> Acquire UTC
    // AT+QLTS=2 -> Acquire JST
    _AtSerial.WriteCommand("AT+QLTS=2");
    
    if (!_AtSerial.ReadResponse("^\\+QLTS: (.*)$", 500, &response)) return RET_ERR(false, E_UNKNOWN);
    if (!_AtSerial.ReadResponse("^OK$", 500, NULL)) return RET_ERR(false, E_UNKNOWN);
    
    if (strlen(response.c_str()) != 26) return RET_ERR(false, E_UNKNOWN);
    
    const char* parameter = response.c_str();
    
    if (parameter[0] != '"') return RET_ERR(false, E_UNKNOWN);
    if (parameter[5] != '/') return RET_ERR(false, E_UNKNOWN);
    if (parameter[8] != '/') return RET_ERR(false, E_UNKNOWN);
    if (parameter[11] != ',') return RET_ERR(false, E_UNKNOWN);
    if (parameter[14] != ':') return RET_ERR(false, E_UNKNOWN);
    if (parameter[17] != ':') return RET_ERR(false, E_UNKNOWN);
    if (parameter[23] != ',') return RET_ERR(false, E_UNKNOWN);
    if (parameter[25] != '"') return RET_ERR(false, E_UNKNOWN);
    
    tim->tm_year = atoi(&parameter[1]) - 1900;
    tim->tm_mon = atoi(&parameter[6]) - 1;
    tim->tm_mday = atoi(&parameter[9]);
    tim->tm_hour = atoi(&parameter[12]);
    tim->tm_min = atoi(&parameter[15]);
    tim->tm_sec = atoi(&parameter[18]);
    tim->tm_wday = 0;
    tim->tm_yday = 0;
    tim->tm_isdst = 0;
    
    // Update tm_wday and tm_yday
    mktime(tim);
    
    return RET_OK(true);
}

void NectisCellular::GetCurrentTime(struct tm *tim) {
    // Get time in JST.
    while (!IsTimeGot(tim)) {
        Serial.println("### ERROR! ###");
        delay(5000);
    }
}

float NectisCellular::ReadVusb() {
    float mv_per_lsb = 3600.0F/1024.0F; // 10-bit ADC with 3.6V input range
    
    int adcvalue = 0;
    float battery_level_mv = 0;
    
    // Get a fresh ADC value
    adcvalue = analogRead(USB_VOLTAGE_PIN);
    battery_level_mv = (float)adcvalue * mv_per_lsb;
    
    return battery_level_mv;
}

float NectisCellular::ReadVbat(void) {
    #define VBAT_MV_PER_LSB   (1.171875F)       // 1.2V ADC range and 10-bit ADC resolution = 1200mV/1024
    #define VBAT_DIVIDER      (0.25F)           // From IC: RP124N334E
    
    digitalWrite(BATTERY_LEVEL_ENABLE_PIN, HIGH);
    
    int adcvalue = 0;
    
    // Set the analog reference to 1.2V (default = 3.6V)
    analogReference(AR_INTERNAL_1_2);
    
    // Set the resolution to 10-bit (0..1023)
    analogReadResolution(10); // Can be 8, 10, 12 or 14
    
    // Let the ADC settle
    delay(100);
    
    // Get the raw 10-bit, 0..1200mV ADC value
    adcvalue = analogRead(BATTERY_VOLTAGE_PIN);
    while ((adcvalue < 0) || (adcvalue > 1023)) {
        adcvalue = analogRead(BATTERY_VOLTAGE_PIN);
    }
    
