cami/Adafruit_nRF52_Arduino/libraries/BG96_LibForArduino/src/NectisCellular.cpp
    Serial.printf("adc_value: %d\n",adcvalue);
    
    // Convert the raw value to compensated mv, taking the resistor-
    // divider into account (providing the actual LIPO voltage)
    float battery_voltage_mv = (float) adcvalue * VBAT_MV_PER_LSB * (1/VBAT_DIVIDER);
    
    // Set the ADC back to the default settings
    analogReference(AR_DEFAULT);
    analogReadResolution(10);
    
    digitalWrite(BATTERY_LEVEL_ENABLE_PIN, LOW);
    
    return battery_voltage_mv;
}

float NectisCellular::mvToPercent(float mvolts) {
    float battery_level;
    
    // When mvolts drops to (3200mA * 102%), the power supply from the battery shut down.
    // Therefore, 0% of the battery level is set to 3250mA.
    if (mvolts >= 4150) {
        battery_level = 100;
    } else if (mvolts > 3750) {
        battery_level = 100.0 * (1.0 - (4150-mvolts)/900);
    } else if (mvolts > 3650) {
        battery_level = 50;
    } else if (mvolts > 3250) {
        battery_level = 100.0 * (1.0 - (4150-mvolts)/900);
    } else {
        battery_level = 0;
    }
    
    return battery_level;
}

void NectisCellular::PwmSetup(int pin, uint8_t flash_interval) {
    HwPWM0.addPin(pin);
    
    // Enable PWM modules with 15-bit resolutions(max) but different clock div
    HwPWM0.setResolution(15);
    HwPWM0.setClockDiv(flash_interval);
}

void NectisCellular::PwmBegin() {
    HwPWM0.begin();
}

void NectisCellular::PwmWritePin(int pin) {
    const int maxValue = bit(15) - 1;
    
    // fade in from min to max
    for (int fadeValue = 0; fadeValue <= maxValue; fadeValue += 1024) {
        // Write same value but inverted for Led Blue
        HwPWM0.writePin(pin, fadeValue, false);
        
        // wait for 30 milliseconds to see the dimming effect
        delay(30);
    }
    
    // fade out from max to min
    for (int fadeValue = maxValue; fadeValue >= 0; fadeValue -= 1024) {
        // Write same value but inverted for Led Blue
        HwPWM0.writePin(pin, fadeValue, false);
        
        // wait for 30 milliseconds to see the dimming effect
        delay(30);
    }
}

void NectisCellular::PwmStop() {
    HwPWM0.stop();
}

void NectisCellular::PwmActivate(int pin, uint8_t flash_interval) {
    PwmSetup(pin, flash_interval);
    NectisCellular::PwmBegin();
    PwmWritePin(pin);
    PwmStop();
}

char* NectisCellular::ConvertDecimalToHex(unsigned long int const decimal, int byte_size) {
    // The last index of post_data is filled with 0x00 for print function.
    memset(&hexConvertedFromDecimal[0], 0x00, sizeof(hexConvertedFromDecimal));
    // Serial.printf("ConvertDecimalToHex decimal: %u\n", decimal);
    
    for (int i = 0; i < (int) byte_size; i++) {
        // 16進数に変換し、４ビットずつ post_data を埋めていく
        hexConvertedFromDecimal[i] = (decimal >> (8 * ((byte_size - 1) - i))) & 0xff;
        // Serial.printf("(decimal >> (8*((byte_size-1)-i))):%x\n", (decimal >> (8 * ((byte_size - 1) - i))));
        // Serial.printf("hexConvertedFromDecimal[i]:%02x\n", hexConvertedFromDecimal[i]);
    }
    return hexConvertedFromDecimal;
}

unsigned int NectisCellular::GetDataDigits(unsigned int data) {
    // Copy the original data to calculate digits in order not to affect the original value.
    unsigned int data_to_calc_digit = data;
    unsigned int data_digit_hex = 0;
    
    // Calculating the digits of lat, lng in hexadecimal.
    // 2 digits = 1 byte
    // Calculating the bytes of the post data
    while (data_to_calc_digit != 0) {
        data_to_calc_digit /= 16;
        data_digit_hex++;
    }
    unsigned int size_of_post_data = (int)(ceil((double)data_digit_hex / 2));
    
    return size_of_post_data;
}

char* NectisCellular::ConvertIntoBinary(char* PostDataBinary, uint8_t data, unsigned int data_length) {
    memset(&PostDataBinary[0], 0x00, data_length);
    memcpy(&PostDataBinary[0], ConvertDecimalToHex(data, data_length), data_length);
    
    return PostDataBinary;
}

char* NectisCellular::ConvertIntoBinary(char* PostDataBinary, uint16_t data, unsigned int data_length) {
    memset(&PostDataBinary[0], 0x00, data_length);
    memcpy(&PostDataBinary[0], ConvertDecimalToHex(data, data_length), data_length);
    
    return PostDataBinary;
}

char* NectisCellular::ConvertIntoBinary(char* PostDataBinary, uint32_t data, unsigned int data_length) {
    memset(&PostDataBinary[0], 0x00, data_length);
    memcpy(&PostDataBinary[0], ConvertDecimalToHex(data, data_length), data_length);
    
    return PostDataBinary;
}

char* NectisCellular::ConvertIntoBinary(char* PostDataBinary, int data, unsigned int data_length) {
    memset(&PostDataBinary[0], 0x00, data_length);
    memcpy(&PostDataBinary[0], ConvertDecimalToHex(data, data_length), data_length);
    
    return PostDataBinary;
}

void NectisCellular::PostDataViaHttp(char *post_data) {
    Serial.println("### Post.");
    Serial.print("Post:");
    Serial.print(post_data);
    Serial.println("");
    
    WioCellularHttpHeader header;
    header["Accept"] = "*/*";
    header["User-Agent"] = HTTP_USER_AGENT;
    header["Connection"] = "Keep-Alive";
    header["Content-Type"] = HTTP_CONTENT_TYPE;
    
    int status;
    if (!HttpPost(ENDPOINT_URL, post_data, &status, header)) {
        Serial.println("### ERROR! ###");
        goto err;
    }
    Serial.print("Status:");
    Serial.println(status);

err:
    Serial.println("### Wait.");
    delay(INTERVAL);
}

void NectisCellular::PostDataViaUdp(char *post_data) {
    Serial.println("### Open.");
    int connectId;
    connectId = SocketOpen("uni.soracom.io", 23080, NECTIS_UDP);
    if (connectId < 0) {
        Serial.println("### ERROR! ###");
        goto err;
    }
    
    Serial.println("### Send.");
    Serial.print("Send:");
    Serial.print(post_data);
    Serial.println("");
    if (!SocketSend(connectId, post_data)) {
        Serial.println("### ERROR! ###");
        goto err_close;
    }
    
    Serial.println("### Receive.");
    int length;
    length = SocketReceive(connectId, post_data, sizeof(post_data), RECEIVE_TIMEOUT);
    if (length < 0) {
        Serial.println("### ERROR! ###");
        Serial.println(length);
        goto err_close;
    }
    if (length == 0) {
        Serial.println("### RECEIVE TIMEOUT! ###");
        goto err_close;
    }
    Serial.print("Receive:");
    Serial.print(post_data);
    Serial.println("");

err_close:
    Serial.println("### Close.");
    if (!SocketClose(connectId)) {
        Serial.println("### ERROR! ###");
        goto err;
    }

err:
    delay(INTERVAL);
}

